// Валідатор мобільного номера
// Поверніть true, якщо наданий рядок виглядає як дійсний мобільний номер США.

// Користувач може заповнити поле форми в будь-який спосіб, тільки якщо він має формат дійсного номера США. Нижче наведені приклади дійсних форматів номерів США (для інших варіантів посилайтесь на тести, подані нижче):

// 555-555-5555
// (555)555-5555
// (555) 555-5555
// 555 555 5555
// 5555555555
// 1 555 555 5555
// У цьому завданні вам буде надано рядок (наприклад, 800-692-7753 або 8oo-six427676;laskdjf). Ваше завдання — підтвердити або відхилити мобільний номер США на основі будь-якої комбінації форматів, наданих вище. Код зони нумерації є обов’язковим. Якщо надано телефонний код країни, то ви повинні підтвердити, що телефонним кодом країни є 1. Поверніть true, якщо рядок є дійсним мобільним номером США; в іншому випадку поверніть false.

function telephoneCheck(str) {
    return /^(1\s?)?(\(\d{3}\)|\d{3})([\s\-]?)\d{3}([\s\-]?)\d{4}$/.test(str);
}

console.log(telephoneCheck("1 555-555-5555")); // має повертати true.
console.log(telephoneCheck("1 (555) 555-5555")); // має повертати true.
console.log(telephoneCheck("(555)555-5555")); // має повертати true.
console.log(telephoneCheck("1(555)555-5555")); //  має повертати true.
console.log(telephoneCheck("1 555 555 5555")); // має повертати true.
console.log(telephoneCheck("1 456 789 4444")); // має повертати true.
console.log(telephoneCheck("1 555)555-5555")); //має повертати false.
console.log(telephoneCheck("27576227382")); // має повертати false.
console.log(telephoneCheck("555)-555-5555")); //має повертати false.
console.log(telephoneCheck("(555-555-5555")); //має повертати false.
